package ua.george_nika.model;

import org.springframework.stereotype.Component;

/**
 * Created by user on 16.05.16.
 */
@Component
public class Hello extends AbstractEntity{

    Hello(){

        addEntity("Что слышно? --- Порядок полный .","מה נשמע? בסדר גמור.","ма нишма? --- беседер гамур.");
        addEntity("Что нового? --- Все в порядке.","מה חדש? הכל בסדר.","ма хадаш? --- аколь беседер.");
        addEntity("Что мир твой? --- Хорошо очень.","מה שלומך?  טוב מאוד.","ма шломха? --- тов меод.");
        addEntity("Как ты себя чувстуешь? --- Будет хорошо.","איך אתה מרגיש? יהיה טוב.","эйх ата моргиш? --- игье тов.");
        addEntity("Что дела? --- Отлично.","מה העניינימ? מצוין.","ма ханьяним? --- мецуян.");
        addEntity("Что случилось? --- В порядке.","מה קורה? בסדר.","ма коре? --- беседер.");
        addEntity("Хорошо спасибо.","טוב תודה","тов тода.");
        addEntity("Так себе.","ככה ככה","каха каха.");

    }

}
