package ua.george_nika.model;

import org.springframework.stereotype.Component;

/**
 *
 */
@Component
public class InfinitiveVerb extends AbstractEntity{

    InfinitiveVerb(){

        addEntity("жить","לגור","лагур");
        addEntity("приезжать","לבוא","лаво");
        addEntity("чувствовать","להרגיש","леаргиш");
        addEntity("учиться","ללמוד","лилмод");
        addEntity("работать","לעבוד","лаавод");
        addEntity("отдыхать","לנוח","лануах");
        addEntity("делать","לעשות","лаасот");
        addEntity("хотеть","לרצות","лирцот");
        addEntity("разговаривать","לדבר","ледабер");
        addEntity("писать","לכתוב","лихтов");
        addEntity("ехать","לנסוע","линсоа");
        addEntity("уметь","לדעת","ладаат");
        addEntity("спрашивать","לשאול","лишоль");
        addEntity("читать","לקרוא","ликро");
        addEntity("стоить","לעלות","лаалот");
        addEntity("подниматься","לעלות","лаалот");
        addEntity("покупать","לקנות","ликнот");
        addEntity("любить","לאהוב","леэхов");
        addEntity("стоять","לעמוד","лаамод");
        addEntity("собираться","לעמוד","лаамод");
        addEntity("идти","ללכת","лелахет");
        addEntity("водить","לנוהג","линог");
        addEntity("путешествовать","לטייל","летаэль");
        addEntity("сказать","לומר","ломар");
        addEntity("кушать","לאכול","леэхоль");
        addEntity("пить","לשתות","лиштот");
        addEntity("спать","לישון","лишон");
        addEntity("находиться","להימצא","лехимаце");
        addEntity("видеть","לראות","лирот");

        addEntity("понимать","להבין","лехавин");
        addEntity("сидеть","לשבת","лашевет");
        addEntity("посылать","לשלוח","лишлоах");
        addEntity("входить","להיכנס","лехиканес");
        addEntity("выходить","לצאת","лацет");

        addEntity("встречаться","להפגש","леипогеш");
        addEntity("рассказвать","לספר","лесапер");
        addEntity("заканчивать","לסיים","лесаем");
        addEntity("навещать","לבקר","левакер");
        addEntity("знать","להכיר","леакир");
        addEntity("подавать","להגיש","леагишь");
        addEntity("варить еду","לבשל","левашель");
        addEntity("мыться","להתרחץ","лехитрахец");
        addEntity("играть","לשחק","лесахек");
        addEntity("поворачиваться","לפנות","лифнот");

        addEntity("положить","לשים","ласим");
        addEntity("вставать","לקום","лакум");
        addEntity("одеваться","להתלבש","леитлабеш");
        addEntity("побриться","להתגלח","леитгалеах");
        addEntity("разогревать","לחמם","лехамем");
        addEntity("бегать","לרוץ","ларуц");
        addEntity("слышать","לשמוע","лишмо");
        addEntity("думать","לחשוב","лахшов");
        addEntity("постирать","לכבס","лехабес");
        addEntity("записывать","לרשום","лиршом");

//        addEntity("искать","לשים","ласим");
//        addEntity("вставать","לקום","лакум");
//        addEntity("одеваться","להתלבש","леитлабеш");
//        addEntity("побриться","להתגלח","леитгалеах");
//        addEntity("разогревать","לחמם","лехамем");
//        addEntity("бегать","לרוץ","ларуц");
//        addEntity("слышать","לשמוע","лишмо");
//        addEntity("думать","לחשוב","лахшов");
//        addEntity("постирать","לכבס","лехабес");
//        addEntity("записывать","לרשום","лиршом");

//        addEntity("скользить","לשים","ласим");
//        addEntity("вставать","לקום","лакум");
//        addEntity("одеваться","להתלבש","леитлабеш");
//        addEntity("побриться","להתגלח","леитгалеах");
//        addEntity("разогревать","לחמם","лехамем");
//        addEntity("бегать","לרוץ","ларуц");
//        addEntity("слышать","לשמוע","лишмо");
//        addEntity("думать","לחשוב","лахшов");
//        addEntity("постирать","לכבס","лехабес");
//        addEntity("записывать","לרשום","лиршом");

//        addEntity("злиться","לשים","ласим");
//        addEntity("вставать","לקום","лакум");
//        addEntity("одеваться","להתלבש","леитлабеш");
//        addEntity("побриться","להתגלח","леитгалеах");
//        addEntity("разогревать","לחמם","лехамем");
//        addEntity("бегать","לרוץ","ларуц");
//        addEntity("слышать","לשמוע","лишмо");
//        addEntity("думать","לחשוב","лахшов");
//        addEntity("постирать","לכבס","лехабес");
//        addEntity("записывать","לרשום","лиршом");

//        addEntity("возвращаться","לשים","ласим");
//        addEntity("вставать","לקום","лакум");
//        addEntity("одеваться","להתלבש","леитлабеш");
//        addEntity("побриться","להתגלח","леитгалеах");
//        addEntity("разогревать","לחמם","лехамем");
//        addEntity("бегать","לרוץ","ларуц");
//        addEntity("слышать","לשמוע","лишмо");
        addEntity("обязывать","לחייב","лехаев");
//        addEntity("постирать","לכבס","лехабес");
//        addEntity("записывать","לרשום","лиршом");

//        addEntity("взять","לשים","ласим");
//        addEntity("вставать","לקום","лакум");
//        addEntity("одеваться","להתלבש","леитлабеш");
//        addEntity("побриться","להתגלח","леитгалеах");
//        addEntity("разогревать","לחמם","лехамем");
//        addEntity("бегать","לרוץ","ларуц");
//        addEntity("слышать","לשמוע","лишмо");
//        addEntity("думать","לחשוב","лахшов");
//        addEntity("постирать","לכבס","лехабес");
//        addEntity("записывать","לרשום","лиршом");


        addEntity("плавать","לשחות","лисхот");




    }


}
